app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    cat = Category.all

    if cat.present?

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", nil], ["description", nil], ["created_at", "2023-03-31 12:29:34.453141"], ["updated_at", "2023-03-31 12:29:34.453141"]]
---
  def create
    cat = user.category.build(category_params)

    if cat.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    cat = Category.find_by(id: params[:id])