app/controllers/recipes_controller.rb

        def index
            recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"

        def show
            recipe = Recipe.find_by(id: params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]