app/controllers/reviews_controller.rb

        def index
          reviews = Review.all
---
SELECT "reviews".* FROM "reviews"

        def show
            review = Review.find_by(id: params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]