app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "user123"], ["email", "user123@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-31 18:56:28.264966"], ["updated_at", "2023-03-31 18:56:28.264966"]]
---
    def register
        user = User.create(user_params)

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "user1235"], ["email", "user12345@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-01 08:15:40.477811"], ["updated_at", "2023-04-01 08:15:40.477811"]]
---
    def login
        user = User.create!(user_params)