app/controllers/users_controller.rb

    def login
        sql = "username = :username OR email = :email"
        user = User.where(sql, { username: user_params[:username], email: user_params[:email] }).first
---
SELECT "users".* FROM "users" WHERE (username = 'user123' OR email = 'user123@gmail.com') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]