app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "user125"], ["email", "user125@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-01 09:42:05.557166"], ["updated_at", "2023-04-01 09:42:05.557166"]]
---
    def login
        user = User.create!(user_params)